In [1]:
%load_ext sql

In [3]:
%%sql sqlite:///bikeshare.db
SELECT
  *
FROM
  trip_data
LIMIT
  10

Done.

[(0, 3548, '2011-01-01 00:01:29.000000', '2011-01-01 01:00:37.000000', 31620, 31620, 'W00247', 'Member'),
 (1, 346, '2011-01-01 00:02:46.000000', '2011-01-01 00:08:32.000000', 31105, 31101, 'W00675', 'Casual'),
 (2, 562, '2011-01-01 00:06:13.000000', '2011-01-01 00:15:36.000000', 31400, 31104, 'W00357', 'Member'),
 (3, 434, '2011-01-01 00:09:21.000000', '2011-01-01 00:16:36.000000', 31111, 31503, 'W00970', 'Member'),
 (4, 233, '2011-01-01 00:28:26.000000', '2011-01-01 00:32:19.000000', 31104, 31106, 'W00346', 'Casual'),
 (5, 158, '2011-01-01 00:32:33.000000', '2011-01-01 00:35:11.000000', 31605, 31618, 'W01033', 'Member'),
 (6, 560, '2011-01-01 00:35:48.000000', '2011-01-01 00:45:09.000000', 31203, 31201, 'W00766', 'Member'),
 (7, 503, '2011-01-01 00:36:42.000000', '2011-01-01 00:45:05.000000', 31203, 31201, 'W00506', 'Member'),
 (8, 449, '2011-01-01 00:45:55.000000', '2011-01-01 00:53:24.000000', 31201, 31202, 'W00506', 'Member'),
 (9, 442, '2011-01-01 00:46:06.000000', '2011-01-01 00:53:28.000000', 31201, 31202, 'W00766', 'Member')]

What were the 10 bikes that got most used by members (in terms of duration, not number of rides)?

In [7]:
%%sql sqlite:///bikeshare.db
SELECT bike_number, SUM(duration) AS total_duration
FROM trip_data
GROUP BY bike_number
ORDER BY total_duration DESC
LIMIT 10

Done.

[('W00427', 1972792),
 ('W00121', 1949010),
 ('W01015', 1938801),
 ('W01039', 1916543),
 ('W00730', 1910715),
 ('W00439', 1907762),
 ('W00764', 1893303),
 ('w00223', 1888296),
 ('W00164', 1885402),
 ('W00757', 1878195)]

What are the stations that most frequently used to drop-off bikes picked up elsewhere (excluding rides that started and ended at the same station, count the number of rides ending at each station)?

In [11]:
%%sql sqlite:///bikeshare.db
SELECT end_station, count(*) AS num_rides
FROM trip_data
WHERE start_station != end_station

GROUP BY end_station
ORDER BY num_rides DESC
LIMIT 10

Done.

[(31200, 51894),
 (31201, 35811),
 (31623, 31410),
 (31214, 28286),
 (31104, 25544),
 (31101, 24677),
 (31228, 24285),
 (31205, 24153),
 (31203, 23753),
 (31229, 23275)]